Table of Contents
 Class ConnectionHiddenCheckClient
Namespace
IdeaStatiCa.Plugin
Assembly
IdeaStatiCa.Plugin.dll
public class ConnectionHiddenCheckClient : ClientBase<IConnHiddenCheck>, ICommunicationObject, IDisposable, IConnHiddenCheck
Inheritance
object
ClientBase<IConnHiddenCheck>
ConnectionHiddenCheckClient
Implements
ICommunicationObject
IDisposable
IConnHiddenCheck
Inherited Members
 ClientBase<IConnHiddenCheck>.GetDefaultValueForInitialization<T>()
 ClientBase<IConnHiddenCheck>.Open()
 ClientBase<IConnHiddenCheck>.Abort()
 ClientBase<IConnHiddenCheck>.Close()
 ClientBase<IConnHiddenCheck>.DisplayInitializationUI()
 ClientBase<IConnHiddenCheck>.CreateChannel()
 ClientBase<IConnHiddenCheck>.InvokeAsync(ClientBase<IConnHiddenCheck>.BeginOperationDelegate, object[], ClientBase<IConnHiddenCheck>.EndOperationDelegate, SendOrPostCallback, object)
 ClientBase<IConnHiddenCheck>.Channel
 ClientBase<IConnHiddenCheck>.CacheSetting
 ClientBase<IConnHiddenCheck>.ChannelFactory
 ClientBase<IConnHiddenCheck>.ClientCredentials
 ClientBase<IConnHiddenCheck>.State
 ClientBase<IConnHiddenCheck>.InnerChannel
 ClientBase<IConnHiddenCheck>.Endpoint
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Constructors
 ConnectionHiddenCheckClient(Binding, EndpointAddress, IPluginLogger)
public ConnectionHiddenCheckClient(Binding binding, EndpointAddress remoteAddress, IPluginLogger logger)
Parameters
binding Binding
remoteAddress EndpointAddress
logger IPluginLogger
Fields
 Logger
protected readonly IPluginLogger Logger
Field Value
IPluginLogger
Properties
 HiddenCalculatorId
public static int HiddenCalculatorId { get; set; }
Property Value
int
 Service
protected IConnHiddenCheck Service { get; }
Property Value
IConnHiddenCheck
Methods
 AddBoltAssembly(string)
Add the new bolt assembly. Its type is defined by its name (e.g. 'M12 4.6')
public int AddBoltAssembly(string boltAssemblyName)
Parameters
boltAssemblyName string
Returns
int
 ApplyParameters(string, string)
Apply parametersJSON on connectionconnectionIdIOM Parameters
public string ApplyParameters(string connectionId, string parametersJSON)
Parameters
connectionId string
Id of the parameter
parametersJSON string
JSON string including parameters
Returns
string
 ApplySimpleTemplate(string, string, ApplyConnTemplateSetting, int, List<int>)
Apply the simple connectionsimple template from file templateFilePath on connection connectionId
public string ApplySimpleTemplate(string connectionId, string templateFilePath, ApplyConnTemplateSetting connTemplateSetting, int mainMember, List<int> attachedMembers)
Parameters
connectionId string
The id of the connection on which templete will be applied
templateFilePath string
The path to the connection teplate
connTemplateSetting ApplyConnTemplateSetting
The additional settings - e.g. default bolts
mainMember int
Main (supporting member)
attachedMembers List<int>
The list of members which are supported by mainMember
Returns
string
Returns 'Ok' in case of the success otherwise 'Fail'
 ApplyTemplate(string, string, ApplyConnTemplateSetting)
Apply the selected template in file conTemplateFileName on connection connectionId
public string ApplyTemplate(string connectionId, string conTemplateFileName, ApplyConnTemplateSetting connTemplateSetting)
Parameters
connectionId string
Identifier of the connection in the project, empty guid means the first connection in the project
conTemplateFileName string
contemp filename including connection template
connTemplateSetting ApplyConnTemplateSetting
Additional setting for application of the template.
Returns
string
returns 'OK' if success otherwise an error message
 Calculate(string)
Cakculate connection given by connectionId
public ConnectionResultsData Calculate(string connectionId)
Parameters
connectionId string
The identifier of the required connection
Returns
ConnectionResultsData
Connection check results
 CalculateBuckling(string)
public ConnectionResultsData CalculateBuckling(string connectionId)
Parameters
connectionId string
Returns
ConnectionResultsData
 Cancel()
Cancel current calcullation
public void Cancel()
 CloseProject()
Close project which is open in the service
public void CloseProject()
 CreateConProjFromIOM(string, string, string)
Creates Idea connection project from given iomXmlFileName, iomResXmlFileName and projects saves into the newIdeaConFileName
public void CreateConProjFromIOM(string iomXmlFileName, string iomResXmlFileName, string newIdeaConFileName)
Parameters
iomXmlFileName string
Filename of a given IOM xml file
iomResXmlFileName string
Filename of a given IOM Result xml file
newIdeaConFileName string
File name of idea connection project where generated project will be saved
 DeleteAllOperations(string)
Delete all manufacturing operations in connectionId
public string DeleteAllOperations(string connectionId)
Parameters
connectionId string
Id of the connection
Returns
string
Returns 'Ok' in case of the success otherwise 'Fail'
 EvaluateExpression(string, string, string)
Evaluate expression on connection model connectionId
public string EvaluateExpression(string connectionId, string expression, string arumentsJSON)
Parameters
connectionId string
Id of the connection in the open idea connection project
expression string
User expression to be evaluated
arumentsJSON string
Optional agruments in json format (not used now)
Returns
string
In case of a success it is the JSON string representing the result of the query. String 'null' if nothing is found. String 'error' in case of any other unspecified error.
 ExportToTemplate(string, string)
Export the manufacture sequence of connectionId as a template and save it in conTemplateFileName (.contemp file)
public string ExportToTemplate(string connectionId, string conTemplateFileName)
Parameters
connectionId string
Identifier of the connection in the project, empty guid means the first connection in the project
conTemplateFileName string
The file name of the output file
Returns
string
returns 'OK' if success otherwise an error message
 GetAllConnectionData(string)
Get structural data and corresponding results of FE analysi for connectionId
public string GetAllConnectionData(string connectionId)
Parameters
connectionId string
Identifier of the required connection
Returns
string
XML string which prepresents the instance of of IdeaRS.OpenModel.OpenModelContainer (stuctural data and results of FE analysis)
 GetBoltAssembliesInProject()
Get all bolt assemblies in the currently open project
public List<ProjectItem> GetBoltAssembliesInProject()
Returns
List<ProjectItem>
Bolt assemblies in the project
 GetCheckResultsJSON(string)
Get the details results of the connection connectionId
public string GetCheckResultsJSON(string connectionId)
Parameters
connectionId string
Id of the connection
Returns
string
Json which represents
 GetCodeSetupJSON()
Get code setup in JSON format IOM connection setup
public string GetCodeSetupJSON()
Returns
string
 GetConnectionCost(string)
Gets connection price given by connectionId
public string GetConnectionCost(string connectionId)
Parameters
connectionId string
The identifier of the required connection
Returns
string
Connection price results
 GetConnectionLoadingJSON(string)
Get loading for connection connectionId (List of CalcCaseData)
public string GetConnectionLoadingJSON(string connectionId)
Parameters
connectionId string
Id of the parameter
Returns
string
 GetConnectionModel(string)
Get the geometry of the connectionId
public ConnectionData GetConnectionModel(string connectionId)
Parameters
connectionId string
Identifier of the required connection
Returns
ConnectionData
Geometry of the connection in the IOM format
 GetConnectionModelXML(string)
Get the geometry of the connectionId
public string GetConnectionModelXML(string connectionId)
Parameters
connectionId string
Identifier of the required connection
Returns
string
Geometry of the connection in the Xml format
 GetCrossSectionsInProject()
Get all cross-sections in the currently open project
public List<ProjectItem> GetCrossSectionsInProject()
Returns
List<ProjectItem>
Cross-sections in the project
 GetMaterialsInProject()
Get all materials in the currently open project
public List<ProjectItem> GetMaterialsInProject()
Returns
List<ProjectItem>
Materials in the project
 GetParametersJSON(string)
Get list of parameters in JSON format for connectionIdIOM Parameters
public string GetParametersJSON(string connectionId)
Parameters
connectionId string
Id of the parameter
Returns
string
 GetProjectInfo()
Gets details about the open project and its connections
public ConProjectInfo GetProjectInfo()
Returns
ConProjectInfo
 OpenProject(string)
Open idea project in the service
public void OpenProject(string ideaConFileName)
Parameters
ideaConFileName string
 Save()
Saves the current data
public void Save()
 SaveAsProject(string)
Save the current data in file newProjectFileName
public void SaveAsProject(string newProjectFileName)
Parameters
newProjectFileName string
File name of the new idea connection project
 SetCrossSectionMaterial(int, int)
Change the material of a cross-section currently available in the Project
public void SetCrossSectionMaterial(int crossSectionId, int materialId)
Parameters
crossSectionId int
Id of the cross-section
materialId int
Id of the material
 SetMemberCrossSection(string, int, int)
Change the cross-section of a member in a connection in the Project through
public void SetMemberCrossSection(string connectionId, int memberId, int crossSectionId)
Parameters
connectionId string
Id of the connection
memberId int
Id of the member
crossSectionId int
Id of the cross-section
 UpdateCodeSetupJSON(string)
Set codesetup for the connection
public string UpdateCodeSetupJSON(string connectionSetupJSON)
Parameters
connectionSetupJSON string
connection setup in JSON format
Returns
string
 UpdateConProjFromIOM(string, string)
Update opened Idea connection project from given iomXmlFileName, iomResXmlFileName
public void UpdateConProjFromIOM(string iomXmlFileName, string iomResXmlFileName)
Parameters
iomXmlFileName string
Filename of a given IOM xml file
iomResXmlFileName string
Filename of a given IOM Result xml file
 UpdateLoadingFromJson(string, string)
Set loading for the connection
public string UpdateLoadingFromJson(string connectionId, string loadingJSON)
Parameters
connectionId string
Id of the connection
loadingJSON string
JSON including list of CalcCaseData
Returns
string
 Edit this page